tests/load/socket-tables.yml
config:
  target: "http://localhost"
  variables:
    loadTarget: "http://localhost"
  phases:
    - name: "100 two-player tables"
      duration: 60
      arrivalCount: 100
      maxVusers: 100
  processor: "./socket-tables-processor.ts"
  plugins:
    ensure:
      maxErrorRate: 0
      thresholds:
        - "poker.ack_ms.p95": 250
        - "poker.event_loop_lag_ms.max": 100
      conditions:
        - expression: "poker.duplicate_commits == 0"
        - expression: "poker.reconnect_success / poker.reconnect_attempts >= 0.99"

scenarios:
  - name: "create, play, deduplicate, and reconnect a heads-up table"
    flow:
      - function: "runTwoPlayerTable"